Autodesk.Navisworks.Api.PickItemResult
Represents the result of doing a HitTest in a view

Autodesk.Navisworks.Api.PickItemResult.#ctor
Constructor for PickItemResult.

Autodesk.Navisworks.Api.PickItemResult.ModelItem
The model item that was picked.

Autodesk.Navisworks.Api.PickItemResult.Normal
The normal of the picked item

Autodesk.Navisworks.Api.PickItemResult.Point
The picked point on the surface of the picked model item (in world space).

Autodesk.Navisworks.Api.PickItemResult.ResultBits
The type of item that was picked